AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

CommonModules/ЗаполнениеБухгалтерскойОтчетностиПоясненияФинансовыеВложения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Описывает состав прикладных данных таблицы отчета.
// Под таблицей понимается совокупность строк с одинаковым составом колонок.
// Обычно каждая таблица в отчете имеет отдельное название, номер и шапку с описанием колонок.
//
// Параметры:
//  Описание - см. ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйОписаниеТаблицыОтчета - заполняемая коллекция
//  ИмяТаблицыОтчета - Строка - имя таблицы из ЗаполнениеБухгалтерскойОтчетностиРазмещение.СоставТаблицОтчета
//
Процедура ОписатьТаблицуОтчета(Описание, ИмяТаблицыОтчета) Экспорт
	
	Если ИмяТаблицыОтчета = "ФинансовыеВложенияНаличиеДвижение" Тогда
		ОписатьТаблицуНаличиеДвижение(Описание);
	КонецЕсли;
		
КонецПроцедуры

// Определяет состав заполняемых пояснений конкретного отчета (за конкретный период, по конкретной организации)
//
// Параметры:
//  ТаблицыОтчета - Структура - Ключ - имя таблицы из ЗаполнениеБухгалтерскойОтчетностиРазмещение.СоставТаблицОтчета; Значение - Булево.
//                  Для заполняемых пояснений следует установить значение Истина, состав коллекции изменять не следует.
//  КонтекстОтчета - см. БухгалтерскаяОтчетностьБРО.НовыйКонтекстОтчета
//
Процедура ОпределитьСоставЗаполняемыхПояснений(ТаблицыОтчета, КонтекстОтчета) Экспорт
	
	ТаблицыОтчета.ФинансовыеВложенияНаличиеДвижение = Истина;
	
КонецПроцедуры

// Заполняет таблицы отчета за один период.
//
// Параметры:
//  ПолучениеДанныхТаблицОтчета - см. ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйПолучениеДанныхТаблицОтчета -
//     процессор, который содержит исходные параметры для получения данных,
//     и в который нужно разместить полученные данные.
//  Классификаторы - Структура - Ключ: имя таблицы отчета; Значение: Структура - Ключ и Значение: имя колонки, содержащей значения по классификатору
//  КонтекстЗаполненияОтчета - см. БухгалтерскаяОтчетностьБРО.НовыйКонтекстЗаполненияОтчета
//
Процедура ЗаполнитьТаблицыОтчета(ПолучениеДанныхТаблицОтчета, Классификаторы, КонтекстЗаполненияОтчета) Экспорт
	
	Если ЗаполнениеБухгалтерскойОтчетностиТабличное.ТаблицаОтчета(ПолучениеДанныхТаблицОтчета, "ФинансовыеВложенияНаличиеДвижение") <> Неопределено Тогда
		ЗаполнитьТаблицуНаличиеДвижение(ПолучениеДанныхТаблицОтчета, Классификаторы, КонтекстЗаполненияОтчета);     
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОписатьТаблицуНаличиеДвижение(Описание) 
			
	Описание.Представление = НСтр("ru = 'Финансовые вложения'");
	Описание.Структура.Добавить("ВариантУчета");
	Описание.Структура.Добавить("Группа"); 
	
	Описание.Классификаторы.Вставить("ВариантУчета", Новый СписокЗначений);
	Описание.Классификаторы.ВариантУчета.Добавить("Долгосрочные",  НСтр("ru = 'Долгосрочные финансовые вложения'"));
	Описание.Классификаторы.ВариантУчета.Добавить("Краткосрочные", НСтр("ru = 'Краткосрочные финансовые вложения'"));
	
	ЧисловыеЗначения = Новый Массив; 
	ЧисловыеЗначения.Добавить("ПервоначальнаяНачало");
	ЧисловыеЗначения.Добавить("КорректировкаНачало");
	ЧисловыеЗначения.Добавить("ПервоначальнаяПоступило");
	ЧисловыеЗначения.Добавить("ПервоначальнаяСписано");
	ЧисловыеЗначения.Добавить("КорректировкаСписано");
	ЧисловыеЗначения.Добавить("КорректировкаПроценты");
	ЧисловыеЗначения.Добавить("КорректировкаПереоценка");
	ЧисловыеЗначения.Добавить("Переклассифицировано");
	ЧисловыеЗначения.Добавить("ПервоначальнаяКонец");
	ЧисловыеЗначения.Добавить("КорректировкаКонец");  
	
	Описание.ЧисловыеЗначения = ЧисловыеЗначения;
	
КонецПроцедуры 

Процедура ЗаполнитьТаблицуНаличиеДвижение(ЗаполняемыеДанные, Классификаторы, КонтекстЗаполненияОтчета)
	
	ПараметрыРасшифровки = ПараметрыРасшифровкиНаличиеДвижение(КонтекстЗаполненияОтчета);
	ШаблоныКолонок = Новый Соответствие;
	ШаблоныРасшифровкиВложения = ШаблоныРасшифровкиНаличиеДвижение(); 
	ШаблоныРасшифровкиРезервы = ШаблоныРасшифровкиНаличиеДвижение(Истина); 
	
	ВыводТаблицы = ЗаполнениеБухгалтерскойОтчетностиТабличное.НачатьВыводТаблицы(
		ЗаполняемыеДанные, "ФинансовыеВложенияНаличиеДвижение", ШаблоныКолонок, ПараметрыРасшифровки); 

	РеквизитыОрганизаций = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		КонтекстЗаполненияОтчета.Организации, "Наименование");					
	
	Для Каждого ОписаниеВариантаУчета Из Классификаторы.ФинансовыеВложенияНаличиеДвижение.ВариантУчета Цикл
		
		ВариантУчета = ОписаниеВариантаУчета.Значение;
		СчетаУчета = СчетаУчетаВложений();
		
		ХозрасчетныйВложения = ХозрасчетныйФинансовыеВложения(
			КонтекстЗаполненияОтчета.Период, КонтекстЗаполненияОтчета.Организации, ВариантУчета); 	
					
		Для Каждого Счет Из СчетаУчета[ВариантУчета] Цикл  
			
			НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет,"Наименование");
			ПараметрыРасшифровки.НаименованиеГруппы = НаименованиеГруппы;
				
			НоваяСтрока = ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСтрокуТаблицыОтчета(
				ВыводТаблицы, ШаблоныРасшифровкиВложения, ПараметрыРасшифровки);
			НоваяСтрока.Группа = НаименованиеГруппы;
			НоваяСтрока.ВариантУчета = ВариантУчета; 
			
			Для Каждого Организация Из КонтекстЗаполненияОтчета.Организации Цикл  
								
				ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьФилиал(
					ВыводТаблицы, ШаблоныРасшифровкиВложения, Организация, РеквизитыОрганизаций[Организация].Наименование);

				ЗаполнитьСтрокуНаличиеДвижение(
					ВыводТаблицы, 
					ХозрасчетныйВложения.НайтиСтроки(
						Новый Структура("Группа, Организация", Счет, Организация))[0], 
					КонтекстЗаполненияОтчета.Период);   
						
			КонецЦикла;   
				
			ЗаполнениеБухгалтерскойОтчетностиТабличное.ЗакончитьДобавлениеСтрокиТаблицыОтчета(
				ВыводТаблицы, ШаблоныРасшифровкиВложения);    
			
		КонецЦикла;
		
		ХозрасчетныйРезервы = ХозрасчетныйРезервыОбесценения(
			КонтекстЗаполненияОтчета.Период, КонтекстЗаполненияОтчета.Организации, ВариантУчета);	   
			
		НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХозрасчетныйРезервы[0].Группа,"Наименование");
		ПараметрыРасшифровки.НаименованиеГруппы = НаименованиеГруппы;
	
		НоваяСтрока = ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСтрокуТаблицыОтчета(
			ВыводТаблицы, ШаблоныРасшифровкиРезервы, ПараметрыРасшифровки);
		НоваяСтрока.Группа = НаименованиеГруппы;		
		НоваяСтрока.ВариантУчета = ВариантУчета;			
		
		Для Каждого Организация Из КонтекстЗаполненияОтчета.Организации Цикл 
			
			ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьФилиал(
				ВыводТаблицы, ШаблоныРасшифровкиРезервы, Организация, РеквизитыОрганизаций[Организация].Наименование);
					
			ЗаполнитьСтрокуРезервы(ВыводТаблицы, ХозрасчетныйРезервы.Найти(Организация, "Организация"), 
				ВариантУчета, КонтекстЗаполненияОтчета.Период);       
				
		КонецЦикла;
		
		ЗаполнениеБухгалтерскойОтчетностиТабличное.ЗакончитьДобавлениеСтрокиТаблицыОтчета(
			ВыводТаблицы, ШаблоныРасшифровкиРезервы);
		
	КонецЦикла; 
	
	
КонецПроцедуры 

Процедура ЗаполнитьСтрокуНаличиеДвижение(ВыводТаблицы, ХозрасчетныйВложение, Период)
	
	Счет = ХозрасчетныйВложение.Группа; 	
	ОСВ_58 = ОСВ(ХозрасчетныйВложение.Организация, Период, Счет);
	
	ПроцентыКПолучению = ПроцентыКПолучению(ХозрасчетныйВложение, Период);
	ПереоценкаДоход = ПереоценкаДоход(ХозрасчетныйВложение, Период);
	ПереоценкаРасход = ПереоценкаРасход(ХозрасчетныйВложение, Период);
		
	// ПервоначальнаяНачало
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "ПервоначальнаяНачало", 
		СтрШаблон(НСтр("ru='Остаток по счету %1'"), Строка(Счет)),
		ХозрасчетныйВложение.Начало, Счет, ОСВ_58);    
	
	// КорректировкаПроценты 	  
	ДобавитьСлагаемое(ВыводТаблицы, "КорректировкаПроценты", ПроцентыКПолучению); 
	
	
	// КорректировкаПереоценка  
	ДобавитьСлагаемое(ВыводТаблицы, "КорректировкаПереоценка", ПереоценкаДоход); 
	
	ВычестьСлагаемое(ВыводТаблицы, "КорректировкаПереоценка", ПереоценкаРасход); 
				
	// ПервоначальнаяПоступило
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "ПервоначальнаяПоступило",
		СтрШаблон(НСтр("ru='Оборот Дт %1'"), Строка(Счет)),
		ХозрасчетныйВложение.Дт, Счет, ОСВ_58); 
		
	ВычестьСлагаемое(ВыводТаблицы, "ПервоначальнаяПоступило", ПроцентыКПолучению);  
		
	ВычестьСлагаемое(ВыводТаблицы, "ПервоначальнаяПоступило", ПереоценкаДоход);
			
	// ПервоначальнаяСписано
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "ПервоначальнаяСписано",
		СтрШаблон(НСтр("ru='Оборот Кт %1'"), Строка(Счет)),
		-ХозрасчетныйВложение.Кт, Счет, ОСВ_58); 
		
	ДобавитьСлагаемое(ВыводТаблицы, "ПервоначальнаяСписано", ПереоценкаРасход); 
	
	// ПервоначальнаяКонец
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "ПервоначальнаяКонец",
		СтрШаблон(НСтр("ru='Остаток по счету %1'"), Строка(Счет)),
		ХозрасчетныйВложение.Конец, Счет, ОСВ_58); 
		
		
КонецПроцедуры

Процедура ЗаполнитьСтрокуРезервы(ВыводТаблицы, ХозрасчетныйРезерв, ВариантУчета, Период)
	
	Счет = ХозрасчетныйРезерв.Группа;
	СтрСчет = Строка(ХозрасчетныйРезерв.Группа);  
	СтрВариантУчета = ?(ВариантУчета="Долгосрочные", НСтр("ru='долгосрочным'"), НСтр("ru='краткосрочным'"));
	Организация = ХозрасчетныйРезерв.Организация; 
	Организации = Новый Массив;
	Организации.Добавить(Организация);
	ВидСравненияОтбора = ?(ВариантУчета="Долгосрочные", ВидСравненияКомпоновкиДанных.НеВСписке, ВидСравненияКомпоновкиДанных.ВСписке);
	
	Отборы = Новый Массив;
	Отбор = НовыйОтборОтчета();
	Отбор.ВидСравнения = ВидСравненияОтбора; 
	Отбор.Поле = "Субконто%1";
	Отбор.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты;
	Контрагенты58_05 = Новый СписокЗначений;  
	Контрагенты58_05.ЗагрузитьЗначения(Контрагенты58_05(Организации, Период));
	Отбор.Значение = Контрагенты58_05;
	Отборы.Добавить(Отбор);
	
	ОСВ_59 = ОСВ(Организация, Период, Счет, Отборы);
	
	// Долгосрочными считаем резервы относящиеся к счету 58, за исключением субсчета 58.05
	// Краткосрочными считаем часть резервов 59, где контрагент в аналитике остатков счета 58.05
	
	// КорректировкаНачало
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "КорректировкаНачало",
		СтрШаблон(НСтр("ru='Остаток по счету %1 по %2 вложениям'"), СтрСчет, СтрВариантУчета),
		ХозрасчетныйРезерв.Начало,,ОСВ_59);
		
	// КорректировкаПереоценка
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "КорректировкаПереоценка",
		СтрШаблон(НСтр("ru='Оборот Кт %1 по %2 вложениям'"), СтрСчет, СтрВариантУчета),
		-ХозрасчетныйРезерв.Кт,,ОСВ_59);  

	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "КорректировкаПереоценка",
		СтрШаблон(НСтр("ru='Оборот Дт %1 по %2 вложениям'"), СтрСчет, СтрВариантУчета),
		ХозрасчетныйРезерв.Дт,,ОСВ_59);  
	
	// КорректировкаКонец
	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, "КорректировкаКонец",
		СтрШаблон(НСтр("ru='Остаток по счету %1 по %2 вложениям'"), СтрСчет, СтрВариантУчета),
		ХозрасчетныйРезерв.Конец,,ОСВ_59);
		
КонецПроцедуры

Функция ПараметрыРасшифровкиНаличиеДвижение(КонтекстЗаполненияОтчета)

	ПараметрыТекстов = Новый Структура;	
	ЗаполнениеБухгалтерскойОтчетностиТабличное.УстановитьПараметрыТекстовРасшифровки(ПараметрыТекстов, КонтекстЗаполненияОтчета);	
	ПараметрыТекстов.Вставить("НаименованиеГруппы", "");
	
	Возврат ПараметрыТекстов;
	
КонецФункции

Функция ШаблоныРасшифровкиНаличиеДвижение(Резервы = Ложь)

	Шаблоны = Новый Соответствие;
	
	Если Резервы Тогда        
		
		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: накопленная корректировка на [НачалоПериода]'");
		Шаблоны.Вставить("КорректировкаНачало", Шаблон); 
					
		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: накопленная корректировка на [КонецПериода]'");
		Шаблоны.Вставить("КорректировкаКонец", Шаблон);  

	Иначе
		
		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: первоначальная стоимость на [НачалоПериода]'");
		Шаблоны.Вставить("ПервоначальнаяНачало", Шаблон); 

		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: первоначальная стоимость на [КонецПериода]'");
		Шаблоны.Вставить("ПервоначальнаяКонец", Шаблон);  

		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: проценты за [Период]'");
		Шаблоны.Вставить("КорректировкаПроценты", Шаблон); 
				
	    Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: поступило за [Период]'");
		Шаблоны.Вставить("ПервоначальнаяПоступило", Шаблон); 

		Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
		Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: списано первоначальная стоимость за [Период]'");
		Шаблоны.Вставить("ПервоначальнаяСписано", Шаблон);       
		
	КонецЕсли;   

	Шаблон = ЗаполнениеБухгалтерскойОтчетностиТабличное.НовыйШаблонЗаголовковРасшифровки();
	Шаблон.ЗаголовокГруппы = НСтр("ru = '[НаименованиеГруппы]: переоценка за [Период]'");
	Шаблоны.Вставить("КорректировкаПереоценка", Шаблон); 
	
	Возврат Шаблоны;
	
КонецФункции  

Функция ХозрасчетныйФинансовыеВложения(Период, Организации, ВариантУчета)
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК Группа,
	|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.КорСчет КАК КорСчет
	|ПОМЕСТИТЬ Проценты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаФИ),
	|			,
	|			Организация В (&Организации)
	|				И КорСубконто1 В
	|					(ВЫБРАТЬ
	|						ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|					ГДЕ
	|						ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПроцентыКПолучению)),
	|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
	|			&ПрочиеДоходыРасходы) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК Группа,
	|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ПереоценкаДоход
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаФИ),
	|			,
	|			Организация В (&Организации)
	|				И КорСубконто1 В
	|					(ВЫБРАТЬ
	|						ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|					ГДЕ
	|						ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПереоценкаФинансовыхИнструментов)),
	|			КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
	|			&ПрочиеДоходыРасходы) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.КорСчет КАК Группа,
	|	ХозрасчетныйОбороты.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ПереоценкаРасход
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
	|			&ПрочиеДоходыРасходы,
	|			Организация В (&Организации)
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|					ИЗ
	|						Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|					ГДЕ
	|						ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПереоценкаФинансовыхИнструментов)),
	|			КорСчет В (&СчетаФИ),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Счет КАК Группа,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК Начало,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК Конец,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК Дт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК Кт,
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ОстаткиОбороты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В (&СчетаФИ), , Организация В (&Организации)) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Группа,
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ГруппыОрганизации
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный,
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В(&Организации)
	|	И Хозрасчетный.Ссылка В(&СчетаФИ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыОрганизации.Организация КАК Организация,
	|	ГруппыОрганизации.Группа КАК Группа,
	|	ЕСТЬNULL(Проценты.Сумма, 0) КАК Проценты,
	|	ЕСТЬNULL(ПереоценкаДоход.Сумма, 0) КАК ПереоценкаДоход,
	|	ЕСТЬNULL(ПереоценкаРасход.Сумма, 0) КАК ПереоценкаРасход,
	|	ЕСТЬNULL(ОстаткиОбороты.Начало, 0) КАК Начало,
	|	ЕСТЬNULL(ОстаткиОбороты.Конец, 0) КАК Конец,
	|	ЕСТЬNULL(ОстаткиОбороты.Дт, 0) КАК Дт,
	|	ЕСТЬNULL(ОстаткиОбороты.Кт, 0) КАК Кт
	|ИЗ
	|	ГруппыОрганизации КАК ГруппыОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проценты КАК Проценты
	|		ПО ГруппыОрганизации.Группа = Проценты.Группа
	|			И ГруппыОрганизации.Организация = Проценты.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПереоценкаДоход КАК ПереоценкаДоход
	|		ПО ГруппыОрганизации.Группа = ПереоценкаДоход.Группа
	|			И ГруппыОрганизации.Организация = ПереоценкаДоход.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПереоценкаРасход КАК ПереоценкаРасход
	|		ПО ГруппыОрганизации.Группа = ПереоценкаРасход.Группа
	|			И ГруппыОрганизации.Организация = ПереоценкаРасход.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиОбороты КАК ОстаткиОбороты
	|		ПО ГруппыОрганизации.Группа = ОстаткиОбороты.Группа
	|			И ГруппыОрганизации.Организация = ОстаткиОбороты.Организация";
	
	                  
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 		  
	
	Запрос.УстановитьПараметр("ПрочиеДоходыРасходы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	Запрос.УстановитьПараметр("СчетаФИ", СчетаУчетаВложений()[ВариантУчета]);    
	Запрос.УстановитьПараметр("НачалоПериода", Период.Начало); 
	Запрос.УстановитьПараметр("КонецПериода", Период.Конец);	
	Запрос.УстановитьПараметр("Организации", Организации); 	 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции     

Функция ХозрасчетныйРезервыОбесценения(Период, Организации, ВариантУчета = Неопределено)
		
	Запрос = Новый Запрос;	
	
	УсловиеВариантУчета = "
	|	Субконто1 В(&Контрагенты58_05)"; 
	Если ВариантУчета = "Долгосрочные" Тогда
		УсловиеВариантУчета = СтрЗаменить(УсловиеВариантУчета, "Субконто1 В", "НЕ Субконто1 В"); 		
	КонецЕсли;        	
	Если ВариантУчета = Неопределено Тогда
		УсловиеВариантУчета = "ИСТИНА";	
	КонецЕсли; 
	Запрос.УстановитьПараметр("Контрагенты58_05", Контрагенты58_05(Организации,Период));
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПодОбесценениеФинансовыхВложений) КАК Группа,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК Начало,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт, 0) КАК Дт,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт, 0) КАК Кт,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК Конец
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				,
	|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПодОбесценениеФинансовыхВложений),
	|				,
	|				Организация В (&Организации)
	|					И &УсловиеВариантУчета) КАК ХозрасчетныйОстаткиИОбороты
	|		ПО ХозрасчетныйОстаткиИОбороты.Организация = Организации.Ссылка";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеВариантУчета",УсловиеВариантУчета);	
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.Начало); 
	Запрос.УстановитьПараметр("КонецПериода", Период.Конец);	
	Запрос.УстановитьПараметр("Организации", Организации);    
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция Контрагенты58_05(Организации, Период) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Ссылка
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретенныеПрава), , Организация В (&Организации)) КАК ХозрасчетныйОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.Начало); 
	Запрос.УстановитьПараметр("КонецПериода", Период.Конец);	
	Запрос.УстановитьПараметр("Организации", Организации);     
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

Функция СчетаУчетаВложений()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И Хозрасчетный.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Хозрасчетный.Код"; 
	
	Запрос.УстановитьПараметр("Ссылка", ПланыСчетов.Хозрасчетный.ФинансовыеВложения); 	
	Долгосрочные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Краткосрочные = Новый Массив;
	Краткосрочные.Добавить(ПланыСчетов.Хозрасчетный.ПриобретенныеПрава); 
	Краткосрочные.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчета); 
	Краткосрочные.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчетаВал);

	Долгосрочные = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Долгосрочные, Краткосрочные);	
	
	Возврат Новый Структура("Долгосрочные, Краткосрочные", Долгосрочные, Краткосрочные); 
	
КонецФункции 

Функция ПроцентыКПолучению(ХозрасчетныйВложение, Период)
	
	Счет = ХозрасчетныйВложение.Группа;
	КорСчет = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
   	ВидСкПроценты = Перечисления.ВидыПрочихДоходовИРасходов.ПроцентыКПолучению; 
	Организация = ХозрасчетныйВложение.Организация;
	
	Слагаемое = НовыйСлагаемое();
	Слагаемое.Описание = СтрШаблон(
		НСтр("ru='Оборот Дт %1 Кт %2 по статьям с видом %3'"),
		Строка(Счет),
		Строка(КорСчет),
		Строка(ВидСкПроценты)); 
		
	Отборы = Новый Массив;
	Отбор = НовыйОтборОтчета();
	Отбор.Поле = "Субконто%1.ВидПрочихДоходовИРасходов";
	Отбор.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы;
	Отбор.Значение = ВидСкПроценты;
	Отборы.Добавить(Отбор);
		
	Слагаемое.Отчет = АнализСчета(Организация, Период, КорСчет, Счет, Отборы);	
	Слагаемое.Сумма = ХозрасчетныйВложение.Проценты; 
		
	Возврат Слагаемое;
	
КонецФункции   

Функция ПереоценкаДоход(ХозрасчетныйВложение, Период)
	
	Счет = ХозрасчетныйВложение.Группа;
	КорСчет = ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
	ПереоценкаФИ = Перечисления.ВидыПрочихДоходовИРасходов.ПереоценкаФинансовыхИнструментов;   
	Организация = ХозрасчетныйВложение.Организация;
	
	Слагаемое = НовыйСлагаемое();
	Слагаемое.Описание = СтрШаблон(
			НСтр("ru='Оборот Дт %1 Кт %2 по статьям с видом %3'"),
			Строка(Счет), 
			Строка(КорСчет),
			Строка(ПереоценкаФИ)); 
			
	Отборы = Новый Массив;
	Отбор = НовыйОтборОтчета();
	Отбор.Поле = "Субконто%1.ВидПрочихДоходовИРасходов";
	Отбор.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы;
	Отбор.Значение = ПереоценкаФИ;
	Отборы.Добавить(Отбор);
			
	Слагаемое.Отчет = АнализСчета(Организация, Период, КорСчет, Счет, Отборы);
	Слагаемое.Сумма = ХозрасчетныйВложение.ПереоценкаДоход;
	
	Возврат Слагаемое;
		
КонецФункции

Функция ПереоценкаРасход(ХозрасчетныйВложение, Период)
	
	Счет = ПланыСчетов.Хозрасчетный.ПрочиеРасходы; 
	КорСчет = ХозрасчетныйВложение.Группа;
	ПереоценкаФИ = Перечисления.ВидыПрочихДоходовИРасходов.ПереоценкаФинансовыхИнструментов;   
	Организация = ХозрасчетныйВложение.Организация;
		
	Слагаемое = НовыйСлагаемое();
	Слагаемое.Описание = СтрШаблон(
		НСтр("ru='Оборот Дт %1 по статьям с видом %2 Кт %3'"),
		Строка(Счет),
		Строка(ПереоценкаФИ),
		Строка(КорСчет)); 
		
	Отборы = Новый Массив;
	Отбор = НовыйОтборОтчета();
	Отбор.Поле = "Субконто%1.ВидПрочихДоходовИРасходов";
	Отбор.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы;
	Отбор.Значение = ПереоценкаФИ;
	Отборы.Добавить(Отбор);
		
	Слагаемое.Отчет = АнализСчета(Организация, Период, Счет, КорСчет, Отборы);
		
	Слагаемое.Сумма = ХозрасчетныйВложение.ПереоценкаРасход;
	
	Возврат Слагаемое;
		
КонецФункции

Функция НовыйСлагаемое()
	Возврат Новый Структура("Описание, Отчет, Сумма");
КонецФункции

Процедура ДобавитьСлагаемое(ВыводТаблицы, ИмяКолонки, Слагаемое) 

	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, ИмяКолонки,
		Слагаемое.Описание,
		Слагаемое.Сумма, 
		Неопределено, 
		Слагаемое.Отчет
	);    
	
КонецПроцедуры  

Процедура ВычестьСлагаемое(ВыводТаблицы, ИмяКолонки, Слагаемое) 

	ЗаполнениеБухгалтерскойОтчетностиТабличное.ДобавитьСлагаемое(
		ВыводТаблицы, ИмяКолонки,
		Слагаемое.Описание,
		-Слагаемое.Сумма, 
		Неопределено, 
		Слагаемое.Отчет
	);    
	
КонецПроцедуры

Функция ОСВ(Организация, Период, Счет, Отборы = Неопределено)
	
	НастройкиОтчета = ЗаполнениеБухгалтерскойОтчетностиРасшифровка.ЗначенияНастроекОтчетаФинансовыеВложения(
		Новый Структура("Организация, Счет", Организация, Счет)	
	);	 
	
	Если ЗначениеЗаполнено(Отборы) Тогда	
		Для Каждого Отбор Из Отборы Цикл
				
			ЗаполнениеБухгалтерскойОтчетностиРасшифровка.НастроитьОтборПоВидуСубконто(
				НастройкиОтчета,
				Отбор.Поле,
				Счет,
				Отбор.ВидСубконто,
				Отбор.Значение,
				Отбор.ВидСравнения
			);		
		КонецЦикла;
	КонецЕсли;

	
	Возврат ЗаполнениеБухгалтерскойОтчетностиРасшифровка.НастройкиОтчетаПоЗначениям(НастройкиОтчета, Период);
		
КонецФункции  

Функция АнализСчета(Организация, Период, Счет, КорСчет = Неопределено, Отборы = Неопределено)  
	
	Параметры = Новый Структура("Счет, Организация, ИмяОтчета, ПоСубсчетамКорСчетов", Счет, Организация, "АнализСчета", Истина);
	Если ЗначениеЗаполнено(КорСчет) Тогда
		Параметры.Вставить("КорСчет", КорСчет);
	КонецЕсли;
	
	НастройкиОтчета = ЗаполнениеБухгалтерскойОтчетностиРасшифровка.ЗначенияНастроекОтчетаФинансовыеВложения(
		Параметры); 
		
	Если ЗначениеЗаполнено(Отборы) Тогда	
		Для Каждого Отбор Из Отборы Цикл
				
			ЗаполнениеБухгалтерскойОтчетностиРасшифровка.НастроитьОтборПоВидуСубконто(
				НастройкиОтчета,
				Отбор.Поле,
				Счет,
				Отбор.ВидСубконто,
				Отбор.Значение,
				Отбор.ВидСравнения
			);		
		КонецЦикла;
	КонецЕсли;
		
	Возврат ЗаполнениеБухгалтерскойОтчетностиРасшифровка.НастройкиОтчетаПоЗначениям(НастройкиОтчета, Период);
	
КонецФункции

Функция НовыйОтборОтчета()
	Возврат Новый Структура("ВидСравнения, Поле, Значение, ВидСубконто", ВидСравненияКомпоновкиДанных.Равно);
КонецФункции

#КонецОбласти
